app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index

     @q = Post.order(created_at: :desc).ransack(params[:q])

INSERT INTO "posts" ("title", "color1", "color2", "color3", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "summer"], ["color1", "099"], ["color2", "333"], ["color3", "222"], ["created_at", "2017-08-05 02:31:51.211072"], ["updated_at", "2017-08-05 02:31:51.211072"]]
---
  def create
    @post =Post.new(post_params)
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "color1" = ?, "color2" = ?, "color3" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "静寂"], ["color1", "666E99"], ["color2", "A3BAC2"], ["color3", "D5DDBB"], ["updated_at", "2017-08-05 06:45:29.886286"], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)